null/xdslog/sentMessages/2015/5/14/sent_RetrieveDocumentSet_null#38de12bd-c793-4c22-bb32-5e8de209f198.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://www.w3.org/2003/05/soap-envelope">
<S:Header>
<To xmlns="http://www.w3.org/2005/08/addressing" xmlns:env="http://www.w3.org/2003/05/soap-envelope" env:mustUnderstand="true">http://iol.test.ohie.org:5001/xdsrepository</To>
<Action xmlns="http://www.w3.org/2005/08/addressing" xmlns:env="http://www.w3.org/2003/05/soap-envelope" env:mustUnderstand="true">urn:ihe:iti:2007:RetrieveDocumentSet</Action>
<ReplyTo xmlns="http://www.w3.org/2005/08/addressing" xmlns:env="http://www.w3.org/2003/05/soap-envelope" env:mustUnderstand="true">
    <Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
</ReplyTo>
<MessageID xmlns="http://www.w3.org/2005/08/addressing">uuid:38de12bd-c793-4c22-bb32-5e8de209f198</MessageID>
</S:Header>
<S:Body>
<ns4:RetrieveDocumentSetRequest xmlns="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0" xmlns:ns2="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0" xmlns:ns3="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0" xmlns:ns4="urn:ihe:iti:xds-b:2007" xmlns:ns5="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0">
<ns4:DocumentRequest>
<ns4:RepositoryUniqueId>1.19.6.24.109.42.1.5.1</ns4:RepositoryUniqueId>
<ns4:DocumentUniqueId>2.16.840.1.113883.3.72.5.9.1.0.5386503746583552594111111111</ns4:DocumentUniqueId>
</ns4:DocumentRequest>
</ns4:RetrieveDocumentSetRequest>
</S:Body>
</S:Envelope>
